# ProjectLocationId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..ProjectLocationId Property
SunAndShadowSettings Class See Also
---
Identifies the ProjectLocation element used by the SunAndShadowSettings element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId ProjectLocationId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProjectLocationId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ProjectLocationId {
	ElementId^ get ();
}
```

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace